/** 
* @brief    蜂鸣器板级支持包
* @details  无源蜂鸣器蜂鸣器相关函数，移植自RM2019工程
* @author   Evan-GH
* @date      2019.11
* @version  1.0
* @par Copyright (c):  RM2020电控
* @par 日志
*			这里必须吐槽大哥实在是太骚了，不过跳舞包拓展包已经被我删了，因为C++电机库莫得投入使用
*/
#include "bsp_beep.h"
#include "tim.h"
#define  R  1000000 //定时器的预分频后的1s的值

#define  ZERO     0U           //休止符
#define  MIN_ZERO 3            //短暂的休止 为了让人可以听出是两个音
#define  L1       (R/262)-1    //低1　Do
#define  half_L1 （R/277)-1    //#1　Do#
#define  L2       (R/294)-1
#define  half_L2  (R/311)-1
#define  L3       (R/330)-1
#define  L4       (R/349)-1
#define  half_L4  (R/370)-1
#define  L5       (R/392)-1
#define  half_L5  (R/410)-1
#define  L6       (R/440)-1
#define  half_L6  (R/466)-1
#define  L7       (R/494)-1

#define  M1       (R/523)-1     //中 Do
#define  half_M1  (R/554)-1
#define  M2       (R/587)-1
#define  half_M2  (R/622)-1
#define  M3       (R/659)-1
#define  M4       (R/698)-1
#define  half_M4  (R/740)-1
#define  M5       (R/784)-1
#define  half_M5  (R/831)-1
#define  M6       (R/880)-1
#define  half_M6  (R/932)-1
#define  M7       (R/988)-1

#define  H1       (R/1046)-1    //高1　Do
#define  half_H1 （R/1109)-1    //#1　Do#
#define  H2       (R/1175)-1
#define  half_H2  (R/1245)-1
#define  H3       (R/1318)-1
#define  H4       (R/1397)-1
#define  half_H4  (R/1480)-1
#define  H5       (R/1568)-1
#define  half_H5  (R/1661)-1
#define  H6       (R/1760)-1
#define  half_H6  (R/1865)-1
#define  H7       (R/1967)-1
#define  END_SONG	 1            //代表此歌已经结束

/**
* @brief  音乐包
* @details  搜刮来的音乐包，全部放在这里了
* @param  NULL
* @retval  NULL
*/
bsp_beep_Song warning[]=
{//处于意外模式的时候可以通过放这段声音来达到警示效果
	{M6,16},{0U,16},{M6,16},{0U,16},{M6,16},{0U,16},{END_SONG,1}
};
bsp_beep_Song warning1_L[]=
{//处于意外模式的时候可以通过放这段声音来达到警示效果
	{L6,64},{0U,16},{END_SONG,1}
};
bsp_beep_Song warning2_L[]=
{//处于意外模式的时候可以通过放这段声音来达到警示效果
	{L6,64},{0U,255},{L6,64},{0U,16},{END_SONG,1}
};
bsp_beep_Song warning3_L[]=
{//处于意外模式的时候可以通过放这段声音来达到警示效果
	{L6,64},{0U,255},{L6,64},{0U,255},{L6,64},{0U,16},{END_SONG,1}
};
bsp_beep_Song warning4_L[]=
{//处于意外模式的时候可以通过放这段声音来达到警示效果
	{L6,64},{0U,255},{L6,64},{0U,255},{L6,64},{0U,255},{L6,64},{0U,16},{END_SONG,1}
};
bsp_beep_Song warning5_L[]=
{//处于意外模式的时候可以通过放这段声音来达到警示效果
	{L6,64},{0U,255},{L6,64},{0U,255},{L6,64},{0U,255},{L6,64},{0U,255},{L6,64},{0U,16},{END_SONG,1}
};
bsp_beep_Song warning6_L[]=
{//处于意外模式的时候可以通过放这段声音来达到警示效果
	{L6,64},{0U,255},{L6,64},{0U,255},{L6,64},{0U,255},{L6,64},{0U,255},{L6,64},{0U,255},{L6,64},{0U,16},{END_SONG,1}
};
bsp_beep_Song warning7_L[]=
{//处于意外模式的时候可以通过放这段声音来达到警示效果
	{L6,64},{0U,255},{L6,64},{0U,255},{L6,64},{0U,255},{L6,64},{0U,255},{L6,64},{0U,255},{L6,64},{0U,255},{L6,64},{0U,16},{END_SONG,1}
};
bsp_beep_Song warning8_L[]=
{//处于意外模式的时候可以通过放这段声音来达到警示效果
	{L6,64},{0U,255},{L6,64},{0U,255},{L6,64},{0U,255},{L6,64},{0U,255},{L6,64},{0U,255},{L6,64},{0U,255},{L6,64},{0U,255},{L6,64},{0U,16},{END_SONG,1}
};
bsp_beep_Song warning1_M[]=
{//处于意外模式的时候可以通过放这段声音来达到警示效果
	{M6,64},{0U,16},{END_SONG,1}
};
bsp_beep_Song warning2_M[]=
{//处于意外模式的时候可以通过放这段声音来达到警示效果
	{M6,64},{0U,255},{M6,64},{0U,16},{END_SONG,1}
};
bsp_beep_Song warning3_M[]=
{//处于意外模式的时候可以通过放这段声音来达到警示效果
	{M6,64},{0U,255},{M6,64},{0U,255},{M6,64},{0U,16},{END_SONG,1}
};
bsp_beep_Song warning4_M[]=
{//处于意外模式的时候可以通过放这段声音来达到警示效果
	{M6,64},{0U,255},{M6,64},{0U,255},{M6,64},{0U,255},{M6,64},{0U,16},{END_SONG,1}
};
bsp_beep_Song warning5_M[]=
{//处于意外模式的时候可以通过放这段声音来达到警示效果
	{M6,64},{0U,255},{M6,64},{0U,255},{M6,64},{0U,255},{M6,64},{0U,255},{M6,64},{0U,16},{END_SONG,1}
};
bsp_beep_Song warning6_M[]=
{//处于意外模式的时候可以通过放这段声音来达到警示效果
	{M6,64},{0U,255},{M6,64},{0U,255},{M6,64},{0U,255},{M6,64},{0U,255},{M6,64},{0U,255},{M6,64},{0U,16},{END_SONG,1}
};
bsp_beep_Song warning7_M[]=
{//处于意外模式的时候可以通过放这段声音来达到警示效果
	{M6,64},{0U,255},{M6,64},{0U,255},{M6,64},{0U,255},{M6,64},{0U,255},{M6,64},{0U,255},{M6,64},{0U,255},{M6,64},{0U,16},{END_SONG,1}
};
bsp_beep_Song warning8_M[]=
{//处于意外模式的时候可以通过放这段声音来达到警示效果
	{M6,64},{0U,255},{M6,64},{0U,255},{M6,64},{0U,255},{M6,64},{0U,255},{M6,64},{0U,255},{M6,64},{0U,255},{M6,64},{0U,255},{M6,64},{0U,16},{END_SONG,1}
};
bsp_beep_Song warning1_H[]=
{//处于意外模式的时候可以通过放这段声音来达到警示效果
	{H6,64},{0U,16},{END_SONG,1}
};
bsp_beep_Song warning2_H[]=
{//处于意外模式的时候可以通过放这段声音来达到警示效果
	{H6,64},{0U,255},{H6,64},{0U,16},{END_SONG,1}
};
bsp_beep_Song warning3_H[]=
{//处于意外模式的时候可以通过放这段声音来达到警示效果
	{H6,64},{0U,255},{H6,64},{0U,255},{H6,64},{0U,16},{END_SONG,1}
};
bsp_beep_Song warning4_H[]=
{//处于意外模式的时候可以通过放这段声音来达到警示效果
	{H6,64},{0U,255},{H6,64},{0U,255},{H6,64},{0U,255},{H6,64},{0U,16},{END_SONG,1}
};
bsp_beep_Song warning5_H[]=
{//处于意外模式的时候可以通过放这段声音来达到警示效果
	{H6,64},{0U,255},{H6,64},{0U,255},{H6,64},{0U,255},{H6,64},{0U,255},{H6,64},{0U,16},{END_SONG,1}
};
bsp_beep_Song warning6_H[]=
{//处于意外模式的时候可以通过放这段声音来达到警示效果
	{H6,64},{0U,255},{H6,64},{0U,255},{H6,64},{0U,255},{H6,64},{0U,255},{H6,64},{0U,255},{H6,64},{0U,16},{END_SONG,1}
};
bsp_beep_Song warning7_H[]=
{//处于意外模式的时候可以通过放这段声音来达到警示效果
	{H6,64},{0U,255},{H6,64},{0U,255},{H6,64},{0U,255},{H6,64},{0U,255},{H6,64},{0U,255},{H6,64},{0U,255},{H6,64},{0U,16},{END_SONG,1}
};
bsp_beep_Song warning8_H[]=
{//处于意外模式的时候可以通过放这段声音来达到警示效果
	{H6,64},{0U,255},{H6,64},{0U,255},{H6,64},{0U,255},{H6,64},{0U,255},{H6,64},{0U,255},{H6,64},{0U,255},{H6,64},{0U,255},{H6,64},{0U,16},{END_SONG,1}
};

bsp_beep_Song warningx[]=
{//处于意外模式的时候可以通过放这段声音来达到警示效果
	{M1,64},{M2,64},{M3,64},{M4,64},{M5,64},{M6,64},{M7,64},{M1,64},{0U,64},{END_SONG,1}
};

bsp_beep_Song ItsOK[]=
{
	{M1,8},{M2,8},{M3,8},{M4,8},{M5,8},{M6,8},{M7,8},{H1,8},{0U,2},
	{H5,4},{H3,8},{H1,8},{H5,4},{H3,8},{H1,8},{H5,4},{H5,4},{H5,4},{END_SONG,1}
};

bsp_beep_Song jile[]=//极乐净土!
{
  {M3,8},{M5,8},
  {M6,8},{0U,8},{0U,8},{M5,8},{M6,8},{0U,8},{0U,8},{M5,8},
  {M6,8},{H1,8},{M5,8},{M6,8},{M3,8},{0U,8},{M3,8},{M5,8},
  {M6,8},{0U,8},{0U,8},{M5,8},{M6,8},{0U,8},{0U,8},{M5,8},
  {M6,8},{H3,8},{H1,8},{H2,8},{M6,8},{0U,8},{M3,8},{M5,8},
  {M6,8},{0U,8},{0U,8},{M5,8},{M6,8},{0U,8},{0U,8},{M5,8},
  {M6,8},{H1,8},{M5,8},{M6,8},{M3,8},{M5,8},{M1,8},{M2,8},
  {M3,4},{H1,4},{M6,4},{H3,4},
  {H2,8},{H3,16},{H2,16},{H1,16},{H2,16},{M6,4},{0U,4},
	
  M6,4,M6,4,M6,4,M6,16,H1,16,H2,16,H3,16,
	M6,4,M6,4,M6,8,M5,8,M5,8,M6,8,
	M6,4,M6,4,M6,4,M6,16,H1,16,H2,16,H3,16,
	M6,4,M6,4,M6,8,H4,8,H4,8,H3,8,
	M6,4,M6,4,M6,4,M6,16,H1,16,H2,16,H3,16,
	M6,4,M6,4,M6,8,M5,8,M5,8,M6,8,
	M6,4,M6,4,M6,4,M6,16,H1,16,H2,16,H3,16,
	M6,4,M6,8,M5,8,M5,8,M6,8,M6,4,

	0U,4,0U,8,M6,8,M5,4,M5,8,M6,8,
	M5,8,M3,4,M5,16,M3,16,M3,4,0U,4,
	0U,4,0U,8,M6,4,M5,8,M6,8,M7,8,
	H1,4,M7,4,M6,8,M7,16,M6,16,M5,4,

	0U,4,0U,8,M6,8,M5,4,M6,8,M5,8,
	M5,8,M3,4,M5,16,M3,16,M3,4,0U,8,M5,8,
	M5,8,M6,8,0U,8,M5,4,M6,8,0U,8,M6,16,M7,16,
	H1,4,H2,4,M6,8,M3,4,M5,8,

	M5,8,M6,8,0U,8,H3,8,H2,4,0U,8,M6,8,
	0U,8,M6,4,H3,8,H2,8,0U,4,
	0U,8,H2,4,H1,8,H2,8,H1,16,M6,16,M6,8,M5,8,
	M5,8,M5,4,M6,4,M3,4,M5,8,

	M5,8,M6,8,0U,8,H3,8,H2,4,0U,8,M6,8,
	0U,8,M6,4,H3,8,H2,8,0U,4,
	0U,8,H2,4,H1,8,H2,8,H1,16,M6,16,M6,16,M3,16,M5,8,
	M5,8,M6,4,M5,8,M6,4,0U,8,M3,16,M5,16,

	M6,8,M6,8,M6,8,H3,8,H3,4,0U,8,M7,16,H1,16,
	H2,8,H1,16,H2,16,H2,8,H3,8,M6,4,0U,8,M5,16,M5,16,
	M6,4,H3,8,H3,16,H2,8,H1,8,M6,8,M5,8,
	M6,8,M6,16,M6,8,H1,8,H2,4,0U,4,

	M6,8,M6,16,M6,16,M6,8,M5,16,M5,16,M6,8,H3,8,0U,8,H1,8,
	H2,8,H1,16,H2,16,H2,8,H3,8,H3,4,0U,8,M5,8,
	M6,8,H1,8,0U,8,M5,8,M6,8,H3,8,0U,8,H3,16,H2,16,
	H1,8,M7,8,M6,8,M5,4,M6,4,0U,8,

	0U,8,M6,8,M5,8,M3,8,M2,8,M3,8,M1,8,L5,8,
	L6,8,L5,8,L6,8,0U,8,L6,4,0U,4,
	L6,4,0U,4,L7,4,0U,4,
	L6,16,L7,16,L6,8,L6,16,L7,16,L6,8,M1,4,0U,4,
	L7,8,M6,8,M5,8,M3,8,M2,8,M3,8,M1,8,L5,8,

	L6,8,L5,8,L6,8,0U,8,L6,4,0U,4,
	L6,4,0U,4,L7,4,0U,4,
	L6,16,L7,16,L6,8,L6,16,L7,16,L6,8,M1,4,0U,4,
	L7,4,L5,4,M6,16,M5,16,M3,16,M2,16,M1,16,L6,16,M2,16,M1,16,

	M6,8,M5,8,M6,8,M5,8,H1,8,M7,8,M6,8,M5,8,
	M5,8,M3,8,M2,8,M1,8,M3,8,M2,8,M1,16,L6,16,L5,16,L6,16,L5,4,L5,8,L3,16,L2,16,L3,4,L3,4,L2,16,L3,16,L4,16,L5,16,L6,16,L7,16,M1,16,M2,16,M2,16,M3,16,M4,16,M5,16,M6,16,M7,16,H1,16,H1,16,
	H3,8,H3,4,H3,8,H3,4,H2,8,H1,8,M7,8,H1,4,H2,8,M7,8,M5,4,M2,8,H2,4,H2,8,H1,8,M7,4,M5,4,M7,4,M7,4,M6,8,M3,8,M3,8,M5,8,
	M5,8,M6,8,0U,8,H3,8,H2,4,0U,8,M6,8,0U,8,M6,8,M6,8,H3,8,H2,4,0U,4,H1,4,H1,8,H2,8,H3,8,H5,8,H3,8,H5,8,H7,4,H6,8,H5,8,H3,8,M3,8,M3,8,M5,8,
	M5,8,M6,8,0U,8,H3,8,H2,4,0U,8,M6,8,0U,8,M6,8,M6,8,H3,8,H2,4,0U,4,0U,8,H2,8,H2,8,H1,8,H2,8,H1,16,M6,16,M6,8,M3,16,M5,16,M5,8,M6,8,M6,8,M5,8,M6,4,0U,8,M3,16,M5,16,
	M6,8,M6,8,M6,8,H3,8,H3,4,0U,8,M7,16,H1,16,H2,8,H1,16,H2,16,H2,8,H3,8,M6,4,0U,8,M5,16,M5,16,M6,4,H3,8,H3,16,H3,16,H2,8,H1,8,M6,8,M5,8,M6,8,M6,16,M6,16,M6,8,H1,8,H2,4,0U,4,
	M6,8,M6,16,M6,16,M6,8,M5,16,M5,16,M6,8,H3,8,0U,8,H1,8,H2,8,H1,16,H2,16,H2,8,H3,8,H3,4,0U,8,H3,8,H2,8,H2,8,0U,8,H1,8,H2,8,H2,8,0U,8,H3,16,H2,16,H1,8,M7,8,M6,8,M5,8,M5,8,M6,8,0U,8,M5,8,
	M6,8,H1,8,0U,8,M5,8,M6,8,H5,8,0U,8,H3,16,H2,16,H2,8,H2,8,H3,8,H5,8,H5,4,H6,4,M6,4,M6,4,M6,4,M6,16,H1,16,H2,16,H3,16,M6,4,M6,4,M6,8,M5,8,M5,8,M6,8,
	M6,4,M6,4,M6,4,M6,16,H1,16,H2,16,H3,16,M6,4,M6,4,M6,8,H4,8,H4,8,H3,8,M6,4,M6,4,M6,4,M6,16,H1,16,H2,16,H3,16,M6,4,M6,4,M6,8,M5,8,M5,8,M6,8,
	M6,4,M6,4,M6,4,M6,16,H1,16,H2,16,H3,16,H6,4,H6,8,M5,8,M5,8,M6,8,M6,4,0U,4,0U,4,0U,4,0U,4,
  {END_SONG,1}

};

bsp_beep_Song Castle_in_the_Sky[] =//天空之城//1/8拍是8
{
  M6,8,M7,8,
	H1,24,M7,8,H1,16,H3,16,
	M7,16,M7,16,M7,16,M3,8,M3,8,ZERO,8,

  M6,24,M5,8,M6,16,H1,16,
	M5,16,M5,16,M5,16,M3,16,
	M4,24,M3,8,M4,16,H1,16,ZERO,8,

  M3,16,M3,16,ZERO,8,H1,8,H1,8,H1,8,
	M7,24,half_M4,8,M4,16,M7,16,
	M7,16,M7,16,ZERO,16,M6,8,M7,8,ZERO,8,

  H1,24,M7,8,H1,16,H3,16,
	M7,16,M7,16,M7,16,M3,8,M3,8,
	M6,24,M5,8,M6,16,H1,16,ZERO,8,

  M5,16,M5,16,M5,16,M2,8,M3,8,
	M4,16,H1,8,M7,8,M7,8,H1,8,H1,16,
	H2,8,H2,8,H3,8,H1,8,H1,16,H1,16,ZERO,8,

  H1,8,M7,8,M6,8,M6,8,M7,16,half_M5,16,
	M6,16,M6,16,M6,16,H1,8,H2,8,
	H3,24,H2,8,H3,16,H5,16,ZERO,8,

  H2,16,H2,16,H2,16,M5,8,M5,8,
	H1,24,M7,8,H1,16,H3,16,
	H3,16,H3,16,H3,16,H3,16,ZERO,8,

  M6,8,M7,8,H1,16,M7,16,H2,8,H2,8,
	H1,24,M5,8,M5,16,M5,16,
	H4,16,H3,16,H2,16,H1,16,ZERO,8,

  H3,16,H3,16,H3,16,H3,16,
	H6,16,H6,16,H5,16,H5,16,
	H3,8,H2,8,H1,16,H1,16,ZERO,8,H1,8,ZERO,8,

  H2,16,H1,8,H2,8,H2,16,H5,16,
	H3,16,H3,16,H3,16,H3,16,
	H6,16,H6,16,H5,16,H5,16,ZERO,8,

  H3,8,H2,8,H1,16,H1,16,ZERO,8,H1,8,
	H2,16,H1,8,H2,8,H2,16,M7,16,
	M6,16,M6,16,M6,16,M6,8,M7,8,ZERO,8,
  {END_SONG,1}
};

bsp_beep_Song Little_star[] =//小星星
{
  M1,16,M1,16,M5,16,M5,16,M6,16,M6,16,M5,32,ZERO,8,
	M4,16,M4,16,M3,16,M3,16,M2,16,M2,16,M1,32,ZERO,8,
	M5,16,M5,16,M4,16,M4,16,M3,16,M3,16,M2,32,ZERO,8,
	M5,16,M5,16,M4,16,M4,16,M3,16,M3,16,M2,32,ZERO,8,
	M1,16,M1,16,M5,16,M5,16,M6,16,M6,16,M5,32,ZERO,8,
	M4,16,M4,16,M3,16,M3,16,M2,16,M2,16,M1,32,ZERO,8,
	{END_SONG,1}
};

bsp_beep_Song INTEL[] =//英特尔经典音乐
{
	H5,16,ZERO,16,M5,32,H1,32,M5,32,H2,32,
	{END_SONG,1}
};

bsp_beep_Song Song_of_Joy[] =//欢乐颂
{
	{M3,8},{M3,8},{M4,8},{M5,8},
	{M5,8},{M4,8},{M3,8},{M2,8},
	{M1,8},{M1,8},{M2,8},{M3,8},
	{M3,4},{M2,16},{M2,4},ZERO,16,

	{M3,8},{M3,8},{M4,8},{M5,8},
	{M5,8},{M4,8},{M3,8},{M2,8},
	{M1,8},{M1,8},{M2,8},{M3,8},
	{M2,4},{M1,16},{M1,4},ZERO,16,

	{M2,8},{M2,8},{M3,8},{M1,8},
	{M2,8},{M3,16},{M4,16},{M3,8},{M1,8},
	{M2,8},{M3,16},{M4,16},{M3,8},{M2,8},
	{M1,8},{M2,8},{L5,8},ZERO,16,

	{M3,8},{M3,8},{M4,8},{M5,8},
	{M5,8},{M4,8},{M3,8},{M4,16},{M2,16},
	{M1,8},{M1,8},{M2,8},{M3,8},
	{M2,4},{M1,16},{M1,4},ZERO,16,

	{M2,8},{M2,8},{M3,8},{M1,8},
	{M2,8},{M3,16},{M4,16},{M3,8},{M1,8},
	{M2,8},{M3,16},{M4,16},{M3,8},{M2,8},
	{M1,8},{M2,8},{L5,8},ZERO,16,

	{M3,8},{M3,8},{M4,8},{M5,8},
	{M5,8},{M4,8},{M3,8},{M4,16},{M2,16},
	{M1,8},{M1,8},{M2,8},{M3,8},
	{M2,4},{M1,16},{M1,4},ZERO,16,
	{END_SONG,1}
};

bsp_beep_Song Kontora[]=
{
	H3,4,H2,4,M7,4,M6,4,M7,4,M6,4,M5,4,M4,4, M5,4,M4,4,M3,4,M2,4, M3,4,L6,4,L7,4,M2,4,
	M3,16,M3,16,M3,8,M7,8,M6,4,M7,4,H1,8,
	H2,16,H2,16,M5,4,L5,4,M3,4,M5,4, M4,4,L4,4,M2,4,M4,4,
	M3,16,M3,16,M3,8,M7,8,M6,4,M7,4,H1,8,
};

bsp_beep_Song News[] =
{ 
	0U,8,M1,8,//01
	M4,8,M1,8,M6,8,M4,8,H1,16,H1,16,//41 64 1- 
  M4,8,M1,8,H3,8,H2,8,M6,16,M6,16,//41 32 6-
	L4,8,M4,8,M6,8,M5,8,M2,16,M2,16,//44 65 2-
	L5,8,M5,8,M6,8,M5,8,H2,16,0U,16,//55 65 2 0
	H1,16,H1,16,H1,16,M1,8,M2,8, //1-- 12
	M4,16,M4,16,M4,16,M4,16,END_SONG,1//4---
};

static uint8_t Flag=0;	//检测运行状态
static uint8_t pluse=0;//音符节拍 以音节为准 16分音符为最小的 只允许取值1 2 4 8 16(x分音符)
static bsp_beep_Song* playing=NULL;//当前放的歌曲

static void bsp_beep_Music_Set_Tone(uint16_t freq)//设定音符频率
{
	__HAL_TIM_SET_AUTORELOAD(&BSP_BEEP_TIM,freq);
	__HAL_TIM_SET_COMPARE(&BSP_BEEP_TIM,BSP_BEEP_CHANNEL,freq/2+1);
	BSP_BEEP_TIM.Instance->CNT=0;//定时器金句！！！！！！！！！！！！！！！！！！！！！！！！！！
}

void bsp_beep_Music_Play(bsp_beep_Song* head)
{
	if(playing!=NULL)return;//已经有在放的歌曲,不要重复放
	playing=head-1;//-1是因为第一个音符不会被演奏
	HAL_TIM_PWM_Start(&BSP_BEEP_TIM,BSP_BEEP_CHANNEL);
	Flag=1;
}
void bsp_beep_Music_Init(void)
{
	if(playing!=NULL)return;
	bsp_beep_Music_Play(Little_star);
}

void bsp_beep_Music_Stop(void) //音乐停止
{
	playing=NULL;
	Flag=0;
	HAL_TIM_PWM_Stop(&BSP_BEEP_TIM,BSP_BEEP_CHANNEL);
}

void bsp_beep_Music_Handle(void)//将这个函数放在定时器更新中断里面 建议0.5s为一次周期 可根据歌曲特性改变周期
{
	if(Flag==0)return;
	if(pluse==0)//说明当前音符演奏完成
	{
		playing++;//指向下一个音符
		if(playing->a==END_SONG)//如果播放完毕
		{
			bsp_beep_Music_Stop();
			return;
		}
		//下面三行是为了产生音符之间的中断
		__HAL_TIM_DISABLE(&BSP_BEEP_TIM);
		bsp_beep_Music_Set_Tone(playing->a);//发出相应音符的声音
		HAL_Delay(10); //这里的延时自己按照效果调整，在操作系统中的话建议使用osDelay
		__HAL_TIM_ENABLE(&BSP_BEEP_TIM);
		pluse=16/playing->p;
	}
	else
	{//说明当前音符时长未到
		pluse--;
	}
}

